<a href="https://colab.research.google.com/github/kvinne-anc/Data-Science-Notebooks/blob/main/Join_and_Reshape_Data_Y.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-05-15 01:59:55--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.13.78
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.13.78|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M   107MB/s    in 1.8s

2020-05-15 01:59:57 (107 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [ ]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [ ]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [ ]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [ ]:
import pandas as pd
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
#Merge ord, opp, opt, and prod
#Sort for top ordered

opt = pd.read_csv('order_products__train.csv')
opt.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0
6         1       47209                  7          0
7         1       22035                  8          1
8        36       39612                  1          0
9        36       19660                  2          1

In [ ]:
opp = pd.read_csv('order_products__prior.csv')
opp.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0
5         2       17794                  6          1
6         2       40141                  7          1
7         2        1819                  8          1
8         2       43668                  9          0
9         3       33754                  1          1

In [ ]:
prod = pd.read_csv('products.csv')
prod.describe()

         product_id      aisle_id  department_id
count  49688.000000  49688.000000   49688.000000
mean   24844.500000     67.769582      11.728687
std    14343.834425     38.316162       5.850410
min        1.000000      1.000000       1.000000
25%    12422.750000     35.000000       7.000000
50%    24844.500000     69.000000      13.000000
75%    37266.250000    100.000000      17.000000
max    49688.000000    134.000000      21.000000

In [ ]:
ord = pd.read_csv('orders.csv')
ord.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [ ]:
#discovered that the 'aisles' and 'departments' files are pretty useless for this task so I eliminated them after exploring them
#I was finally able to pull out the individual products I needed - I want to figure out if I can do them all at once 
#Every attempt to combine them produced an error so I did each separately 
#I discovered that almost all of them are in aisle 24, dept 4 - so many those two sets could be useful after all - jk they're not

In [ ]:
banana = prod[(prod.product_name == 'Banana')]
banana

       product_id product_name  aisle_id  department_id
24851       24852       Banana        24              4

In [ ]:
bob = prod[(prod.product_name == 'Bag of Organic Bananas')]
bob

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4

In [ ]:
straw = prod[(prod.product_name == 'Strawberries')]
straw

       product_id  product_name  aisle_id  department_id
16796       16797  Strawberries        24              4

In [ ]:
ostraw = prod[(prod.product_name == 'Organic Strawberries')]
ostraw

       product_id          product_name  aisle_id  department_id
21136       21137  Organic Strawberries        24              4

In [ ]:
avo = prod[(prod.product_name == 'Avocado')]
avo

       product_id product_name  aisle_id  department_id
48526       48527      Avocado        24              4

In [ ]:
oha = prod[(prod.product_name == 'Organic Hass Avocado')]
oha

       product_id          product_name  aisle_id  department_id
47208       47209  Organic Hass Avocado        24              4

In [ ]:
lime = prod[(prod.product_name == 'Limes')]
lime

       product_id product_name  aisle_id  department_id
26208       26209        Limes        24              4

In [ ]:
lemon = prod[(prod.product_name == 'Large Lemon')]
lemon

       product_id product_name  aisle_id  department_id
47625       47626  Large Lemon        24              4

In [ ]:
milk = prod[(prod.product_name == 'Organic Whole Milk')]
milk

       product_id        product_name  aisle_id  department_id
27844       27845  Organic Whole Milk        84             16

In [ ]:
spinach = prod[(prod.product_name == 'Organic Baby Spinach')]
spinach

       product_id          product_name  aisle_id  department_id
21902       21903  Organic Baby Spinach       123              4

In [ ]:
#This was probably not the best way to do it ^^ but at least now I know the product id numbers and what food they match 
#Everything is in Dept 4 with the exception of milk in dept 16 which is interesting

In [ ]:
food_list = [lemon, lime, milk, oha, avo, banana, bob, straw, ostraw, spinach] 
food_list

#Well that was disappointing

[       product_id product_name  aisle_id  department_id
 47625       47626  Large Lemon        24              4,
        product_id product_name  aisle_id  department_id
 26208       26209        Limes        24              4,
        product_id        product_name  aisle_id  department_id
 27844       27845  Organic Whole Milk        84             16,
        product_id          product_name  aisle_id  department_id
 47208       47209  Organic Hass Avocado        24              4,
        product_id product_name  aisle_id  department_id
 48526       48527      Avocado        24              4,
        product_id product_name  aisle_id  department_id
 24851       24852       Banana        24              4,
        product_id            product_name  aisle_id  department_id
 13175       13176  Bag of Organic Bananas        24              4,
        product_id  product_name  aisle_id  department_id
 16796       16797  Strawberries        24              4,
        product_id          product_name  aisle_id  department_id
 21136       21137  Organic Strawberries        24              4,
        product_id          product_name  aisle_id  department_id
 21902       21903  Organic Baby Spinach       123              4]

In [ ]:
#combined these because they hold a lot of the same categories 

opp_opt = pd.concat([opp, opt], axis=0)
opp_opt.describe

<bound method NDFrame.describe of          order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[33819106 rows x 4 columns]>

In [ ]:
#These product ids match the top foods product ids - tbh tho I don't understand what the second column output represents 
opp_opt['product_id'].value_counts()[:10]

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [ ]:
#Making list of the ids needed: 

Top_food = opp_opt['product_id'].value_counts()[:10].index.tolist()
Top_food

[24852, 13176, 21137, 21903, 47209, 47766, 47626, 16797, 26209, 27845]

In [ ]:
#Making list of top ids and cooresponding order info

condition = opp_opt['product_id'].isin(Top_food)
small_list = opp_opt[condition]
small_list.head(10)

     order_id  product_id  add_to_cart_order  reordered
12          3       21903                  4          1
30          5       13176                  1          1
51          5       47209                 22          0
77         10       24852                  1          1
80         10       47766                  4          1
83         10       21137                  7          1
126        14       27845                  2          1
170        18       47766                 27          1
180        20       24852                  6          0
190        22       24852                  3          1

In [ ]:
#The list has been merged on the common element (product id), 
#inner because it's like joining two sets by the inner part of a venn diagram, 
#but all data from both is included

merge1 = pd.merge(small_list, prod, on='product_id', how='inner')
merge1

         order_id  product_id  ...  aisle_id  department_id
0               3       21903  ...       123              4
1              26       21903  ...       123              4
2              31       21903  ...       123              4
3              39       21903  ...       123              4
4              56       21903  ...       123              4
...           ...         ...  ...       ...            ...
2418309   3418861       26209  ...        24              4
2418310   3418905       26209  ...        24              4
2418311   3419642       26209  ...        24              4
2418312   3420257       26209  ...        24              4
2418313   3420286       26209  ...        24              4

[2418314 rows x 7 columns]

In [ ]:
#Trying to make the dataset look better and display the info needed - it worked! 

fin_df = merge1['product_name'].value_counts(sort=True).to_frame()
fin_df = fin_df.reset_index()
fin_df.columns = ['product_name', 'amount ordered']
fin_df

             product_name  amount ordered
0                  Banana          491291
1  Bag of Organic Bananas          394930
2    Organic Strawberries          275577
3    Organic Baby Spinach          251705
4    Organic Hass Avocado          220877
5         Organic Avocado          184224
6             Large Lemon          160792
7            Strawberries          149445
8                   Limes          146660
9      Organic Whole Milk          142813

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns 

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [ ]:
#reset index to visualize variables
test_table = table2.reset_index()
test_table

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [ ]:
# melt test table to make table 3

In [ ]:
table3 = test_table.melt(id_vars = 'index', value_vars = ['John Smith', 'Jane Doe', 'Mary Johnson'])
table3

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [ ]:
#rename columns 'index' and 'variable'

In [ ]:
table4 = table3.rename(columns={'index' : 'Treatment', 'variable' : 'Name', 'value' : 'Result'})
table4

    Treatment          Name  Result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [ ]:
#reorder the columns 

table4.reindex(columns= ['Name', 'Treatment', 'Value'])

           Name   Treatment  Value
0    John Smith  treatmenta    NaN
1    John Smith  treatmentb    NaN
2      Jane Doe  treatmenta    NaN
3      Jane Doe  treatmentb    NaN
4  Mary Johnson  treatmenta    NaN
5  Mary Johnson  treatmentb    NaN

In [ ]:
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [ ]:
# Flights Pivot Table

In [ ]:
flights1 = pd.pivot_table(flights, index='year', values='passengers', aggfunc='sum')
flights1

#this heading looks stupid so going to try to chnage it

      passengers
year
1949        1520
1950        1676
1951        2042
1952        2364
1953        2700
1954        2867
1955        3408
1956        3939
1957        4421
1958        4572
1959        5140
1960        5714

In [ ]:
pd.pivot_table(flights, index='year', values='passengers', aggfunc='sum').reset_index().rename(columns={'passengers': 'Sum_Passngrs'})

    year  Sum_Passngrs
0   1949          1520
1   1950          1676
2   1951          2042
3   1952          2364
4   1953          2700
5   1954          2867
6   1955          3408
7   1956          3939
8   1957          4421
9   1958          4572
10  1959          5140
11  1960          5714

In [ ]:
#yay even lined headings 
#trying months now 
pd.pivot_table(flights, index ='month', values='passengers', aggfunc='mean').reset_index().rename(columns={'passengers': 'viajeros', 'month': 'mes'})

          mes    viajeros
0     January  241.750000
1    February  235.000000
2       March  270.166667
3       April  267.083333
4         May  271.833333
5        June  311.666667
6        July  351.333333
7      August  351.083333
8   September  302.416667
9     October  266.583333
10   November  232.833333
11   December  261.833333

In [ ]:
#mean of passengers per month
#renamed columns in Spanish

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####